***Pandas is an open sourced software library.
Dataframes and Series are two of its major data structures that are widely used
for data analysis purposes.
Series is an one dimensional indexed array.
DataFrame is tabular data structure with column and row-level indexes.
Pandas is a great tool for preprocessing datasets and offers highly optimized performance***

In [1]:
import pandas as pd

In [2]:
s1 = pd.Series([2,9,0,1]) #creating series object
print(s1)

0    2
1    9
2    0
3    1
dtype: int64

In [3]:
print(s1.values)

[2 9 0 1]

In [4]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
s1.index = ['a','b','c','d']
print(s1)

a    2
b    9
c    0
d    1
dtype: int64

In [8]:
s1['d']

1

In [16]:
#Creating DataFrame using pandas
class_data = {'Names':['John','Ryan','Sai'],'Standard':[7,5,8],
         'SUB':['Eng','Mat','Sci']}

class_df = pd.DataFrame(class_data,index=['Student1','Student2','Student3'],
columns=['Names','Standard','SUB'])

print(class_df)

         Names  Standard  SUB
Student1  John         7  Eng
Student2  Ryan         5  Mat
Student3   Sai         8  Sci

In [17]:
class_df.Names

Student1    John
Student2    Ryan
Student3     Sai
Name: Names, dtype: object

In [19]:
import numpy as np

In [22]:
class_df.loc['Student4'] =['Robin',np.nan,'History']

In [23]:
class_df

          Names  Standard      SUB
Student1   John       7.0      Eng
Student2   Ryan       5.0      Mat
Student3    Sai       8.0      Sci
Student4  Robin       NaN  History

In [24]:
class_df.T

         Student1 Student2 Student3 Student4
Names        John     Ryan      Sai    Robin
Standard        7        5        8      NaN
SUB           Eng      Mat      Sci  History

In [25]:
class_df.sort_values(by='Standard')

          Names  Standard      SUB
Student2   Ryan       5.0      Mat
Student1   John       7.0      Eng
Student3    Sai       8.0      Sci
Student4  Robin       NaN  History

In [38]:
cla = pd.Series(['A','B','A+','C'],index=['Student1','Student2','Student3','Student4'])
class_df['Grade']=cla

In [39]:
print(class_df)

          Names  Standard      SUB Grade
Student1   John       7.0      Eng     A
Student2   Ryan       5.0      Mat     B
Student3    Sai       8.0      Sci    A+
Student4  Robin       NaN  History     C

In [40]:
#filling missing values
cla

Student1     A
Student2     B
Student3    A+
Student4     C
dtype: object

In [42]:
class_df.fillna(10,inplace=True)
print(class_df)

          Names  Standard      SUB Grade
Student1   John       7.0      Eng     A
Student2   Ryan       5.0      Mat     B
Student3    Sai       8.0      Sci    A+
Student4  Robin      10.0  History     C

In [46]:
Student_age =pd.DataFrame(data={'Age':[20,30,40,50]},
                              index = ['Student1','Student2','Student3','Student4'])

Student_age

          Age
Student1   20
Student2   30
Student3   40
Student4   50

In [50]:
class_data = pd.concat([class_df,Student_age],axis=1)
print(class_data)

          Names  Standard      SUB Grade  Age
Student1   John       7.0      Eng     A   20
Student2   Ryan       5.0      Mat     B   30
Student3    Sai       8.0      Sci    A+   40
Student4  Robin      10.0  History     C   50

In [52]:
class_data['SUB']=class_data['SUB'].map(lambda x:x+'Sub')

In [54]:
class_data

          Names  Standard         SUB Grade  Age
Student1   John       7.0      EngSub     A   20
Student2   Ryan       5.0      MatSub     B   30
Student3    Sai       8.0      SciSub    A+   40
Student4  Robin      10.0  HistorySub     C   50

In [55]:
def age_add(x):
    return x+1
print(class_data['Age'])
print()
print(class_data['Age'].apply(age_add))

Student1    20
Student2    30
Student3    40
Student4    50
Name: Age, dtype: int64

Student1    21
Student2    31
Student3    41
Student4    51
Name: Age, dtype: int64

In [58]:
class_data['Grade']=class_data['Grade'].astype('category')
class_data.Grade.dtypes

CategoricalDtype(categories=['A', 'A+', 'B', 'C'], ordered=False)